---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesNonSlabSources
source: html/b4d413c7-94b6-7f6e-2716-07afed35e057.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesNonSlabSources Property

Some sources of a volume divider are non-slab like.

## Syntax (C#)
```csharp
public static FailureDefinitionId DivideVolumesProfilesNonSlabSources { get; }
```